In [3]:
import pandas as pd
df=pd.read_csv("stock_data.csv")
df.head()

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

# nrows

In [11]:
df=pd.read_csv("stock_data.csv",nrows=3)
df

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.
2    MSFT  -1.00       85     64  bill gates

# header

In [7]:
df=pd.read_csv("stock_data.csv",header=None,names=["a","b","c","d","e"])
df

         a              b        c      d              e
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

# skiprows

In [9]:
df=pd.read_csv("stock_data.csv",skiprows=2)
df

    WMT           4.61  484    65           n.a.
0  MSFT             -1   85    64     bill gates
1  RIL   not available   50  1023  mukesh ambani
2  TATA            5.6   -1  n.a.     ratan tata

# usecols

In [16]:
df=pd.read_csv("stock_data.csv",usecols=["tickers","eps","revenue"])
df

  tickers            eps  revenue
0   GOOGL          27.82       87
1     WMT           4.61      484
2    MSFT             -1       85
3    RIL   not available       50
4    TATA            5.6       -1

# dtype

In [21]:
df=pd.read_csv("stock_data.csv",usecols=["tickers","eps","revenue"],dtype={"revemue":"float"})
df

  tickers            eps  revenue
0   GOOGL          27.82       87
1     WMT           4.61      484
2    MSFT             -1       85
3    RIL   not available       50
4    TATA            5.6       -1

# skipfooter

In [22]:
df=pd.read_csv("stock_data.csv",usecols=["tickers","eps","revenue"],skipfooter=1)
df

C:\Users\40019115\AppData\Local\Temp\ipykernel_11284\1282072760.py:1: ParserWarning: Falling back to the 'python' engine because the 'c' engine does not support skipfooter; you can avoid this warning by specifying engine='python'.
  df=pd.read_csv("stock_data.csv",usecols=["tickers","eps","revenue"],skipfooter=1)

  tickers            eps  revenue
0   GOOGL          27.82       87
1     WMT           4.61      484
2    MSFT             -1       85
3    RIL   not available       50

# index_col

In [23]:
df=pd.read_csv("stock_data.csv",index_col=[0])
df

                   eps  revenue price         people
tickers
GOOGL            27.82       87   845     larry page
WMT               4.61      484    65           n.a.
MSFT                -1       85    64     bill gates
RIL      not available       50  1023  mukesh ambani
TATA               5.6       -1  n.a.     ratan tata

# prefix

In [25]:
df=pd.read_csv("stock_data.csv",header=None,prefix="data_")
df

C:\Users\40019115\AppData\Local\Temp\ipykernel_11284\409282180.py:1: FutureWarning: The prefix argument has been deprecated and will be removed in a future version. Use a list comprehension on the column names in the future.


  df=pd.read_csv("stock_data.csv",header=None,prefix="data_")

    data_0         data_1   data_2 data_3         data_4
0  tickers            eps  revenue  price         people
1    GOOGL          27.82       87    845     larry page
2      WMT           4.61      484     65           n.a.
3     MSFT             -1       85     64     bill gates
4     RIL   not available       50   1023  mukesh ambani
5     TATA            5.6       -1   n.a.     ratan tata

# 12.true_values,false_values

In [26]:
l=[
    {"id":1,"name":"rahul","attended":"Yes"},
     {"id":2,"name":"ram","attended":"No"},
        {"id":3,"name":"rohit","attended":"Yes"}
    
]

df=pd.DataFrame(l)
df.to_csv("true.csv")

In [33]:
df1=pd.read_csv("true.csv",true_values=["Yes"],false_values=["No"])
df1

   Unnamed: 0  id   name  attended
0           0   1  rahul      True
1           1   2    ram     False
2           2   3  rohit      True

# squeeze

In [34]:
df1=pd.read_csv("true.csv",usecols=["name"],squeeze=True)
print(type(df1))

<class 'pandas.core.series.Series'>

C:\Users\40019115\AppData\Local\Temp\ipykernel_11284\3318290443.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  df1=pd.read_csv("true.csv",usecols=["name"],squeeze=True)

# chuncksize

In [36]:
import pandas as pd
data=pd.read_csv("stock_data.csv",chunksize=2)
for chunk in data:
    print(chunk)
    print()

  tickers    eps  revenue  price      people
0   GOOGL  27.82       87    845  larry page
1     WMT   4.61      484     65        n.a.

  tickers            eps  revenue  price         people
2    MSFT             -1       85     64     bill gates
3    RIL   not available       50   1023  mukesh ambani

  tickers  eps  revenue price      people
4    TATA  5.6       -1  n.a.  ratan tata